In [235]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
orders = pd.read_excel(r"d:\Users\HP\Desktop\Siddhant Jain\ALabs\Internship Screening Case Study\Internship Screening Case Study.xlsx",
                  sheet_name = "Orders Data",
                  header= 0,
                  parse_dates=['ORDER_DATE'])
orders.head()

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS
0,O100000,C100000,85.00,0.0,2016-05-18,Delivered,ON-TIME
1,O100001,C100001,307.52,0.0,2016-05-18,Delivered,ON-TIME
2,O100002,C100002,0.00,0.0,2016-05-18,Delivered,ON-TIME
3,O100003,C100003,153.73,0.0,2016-05-18,Delivered,ON-TIME
4,O100004,C100004,-39.55,0.0,2016-05-18,Delivered,ON-TIME

In [3]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29616 entries, 0 to 29615
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ORDER_NUMBER     29616 non-null  object
 1   CUSTOMER_KEY     29616 non-null  object
 2   ORDER_TOTAL      29465 non-null  float64
 3   DISCOUNT         29275 non-null  float64
 4   ORDER_DATE       29616 non-null  datetime64[ns]
 5   ORDER_STATUS     29616 non-null  object
 6   DELIVERY_STATUS  29452 non-null  object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 1.6+ MB

In [4]:
customer = pd.read_excel(r"d:\Users\HP\Desktop\Siddhant Jain\ALabs\Internship Screening Case Study\Internship Screening Case Study.xlsx",
                  sheet_name = "Customer Data",
                  header= 0)
customer.head()

,CUSTOMER_ID,CUSTOMER_KEY,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel
0,1,C100000,9693593216,N,M,Chennai,APP
1,2,C100001,9770151476,Y,M,Bangalore,WEBSITE
2,3,C100002,9779085726,N,M,Gurgaon,WEBSITE
3,4,C100003,9298611643,N,M,Gurgaon,APP
4,5,C100004,9929250328,Y,M,Chennai,APP

In [5]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29620 entries, 0 to 29619
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   CUSTOMER_ID               29620 non-null  int64
 1   CUSTOMER_KEY              29620 non-null  object
 2   CONTACT_NUMBER            29620 non-null  int64
 3   Referred Other customers  29620 non-null  object
 4   Gender                    29620 non-null  object
 5   Location                  29620 non-null  object
 6   Acquired Channel          29620 non-null  object
dtypes: int64(2), object(5)
memory usage: 1.6+ MB

In [6]:
## Combining the datasets on CUSTOMER_KEY

df = orders.merge(customer, how = 'outer', on = 'CUSTOMER_KEY')
df.head()

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel
0,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,1.0,9.693593e+09,N,M,Chennai,APP
1,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,11.0,9.693593e+09,N,F,Gurgaon,WEBSITE
2,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,18.0,9.693593e+09,N,F,Chennai,WEBSITE
3,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,26.0,9.693593e+09,N,M,Others,WEBSITE
4,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,6018.0,9.693593e+09,N,M,Gurgaon,WEBSITE

### Q1. Total Revenue (order value)

In [7]:
orders['ORDER_TOTAL'].sum()

22382176.00961324

### Q2. Total Revenue (order value) by top 25 Customers

In [8]:
sum_of_top_25 = df.groupby(['CUSTOMER_KEY'])[['ORDER_TOTAL']].sum()

top_25 = sum_of_top_25.sort_values(by='ORDER_TOTAL',ascending=False).head(25)

top_25['ORDER_TOTAL'].sum()

19890671.340664975

### Q3. Total number of orders

In [9]:
df['ORDER_NUMBER'].count()

173657

### Q4. Total orders by top 10 customers

In [10]:
top_10_customers = df.groupby(['CUSTOMER_KEY'])[['ORDER_NUMBER']].count()

top_10 = top_10_customers.sort_values(by='ORDER_NUMBER',ascending=False).head(10)

In [11]:
top_10['ORDER_NUMBER'].sum()

12945

### Q5. Number of customers (Distinct)

In [12]:
df[['CUSTOMER_KEY']].nunique()

CUSTOMER_KEY    11137
dtype: int64

### Q6. Number of customers ordered once

In [13]:
customers_ordered_once = df.groupby(['CUSTOMER_KEY'])[['ORDER_NUMBER']].count()

ordered_once = customers_ordered_once.sort_values(by='ORDER_NUMBER',ascending=True)

ordered_once[ordered_once['ORDER_NUMBER'] == 1].count()

ORDER_NUMBER    5489
dtype: int64

### Q7. Number of customers ordered multiple times

In [14]:
customers_ordered_multiple_times = df.groupby(['CUSTOMER_KEY'])[['ORDER_NUMBER']].count()

ordered_multiple_times = customers_ordered_multiple_times.sort_values(by='ORDER_NUMBER',ascending=False)

ordered_multiple_times[ordered_multiple_times['ORDER_NUMBER'] > 1].count()

ORDER_NUMBER    5647
dtype: int64

### Q8. Number of customers reffered to other customers

In [15]:
customers_reffered_to_other_customers = df[df['Referred Other customers'] == 'Y']
customers_reffered_to_other_customers

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel
25,O100001,C100001,307.52,0.0,2016-05-18,Delivered,ON-TIME,2.0,9.770151e+09,Y,M,Bangalore,WEBSITE
43,O100004,C100004,-39.55,0.0,2016-05-18,Delivered,ON-TIME,5.0,9.929250e+09,Y,M,Chennai,APP
917,O100011,C100008,329.79,0.0,2016-05-19,Delivered,ON-TIME,12.0,9.938779e+10,Y,F,Bangalore,WEBSITE
1064,O100036,C100025,654.68,0.0,2016-05-20,Delivered,ON-TIME,37.0,9.738608e+09,Y,M,Chennai,WEBSITE
1065,O100036,C100025,654.68,0.0,2016-05-20,Delivered,ON-TIME,87.0,9.738608e+09,Y,M,Gurgaon,APP
...,...,...,...,...,...,...,...,...,...,...,...,...,...
160564,O128143,C15021,19890.14,0.0,2016-07-13,Delivered,ON-TIME,17918.0,9.710501e+09,Y,F,Gurgaon,WEBSITE
160565,O128143,C15021,19890.14,0.0,2016-07-13,Delivered,ON-TIME,18094.0,9.710501e+09,Y,M,Gurgaon,WEBSITE
160566,O128143,C15021,19890.14,0.0,2016-07-13,Delivered,ON-TIME,19451.0,9.710501e+09,Y,F,Gurgaon,WEBSITE
160567,O128143,C15021,19890.14,0.0,2016-07-13,Delivered,ON-TIME,28141.0,9.710501e+09,Y,F,Gurgaon,WEBSITE
160568,O128143,C15021,19890.14,0.0,2016-07-13,Delivered,ON-TIME,28144.0,9.710501e+09,Y,M,Chennai,WEBSITE

In [16]:
customers_referring = customers_reffered_to_other_customers.groupby(['CUSTOMER_KEY'])[['Referred Other customers']].count()
customers_referring.count()

Referred Other customers    17
dtype: int64

### Q9. Which Month have maximum Revenue?

In [17]:
df['month'] = df['ORDER_DATE'].dt.month
df.head()

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel,month
0,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,1.0,9.693593e+09,N,M,Chennai,APP,5.0
1,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,11.0,9.693593e+09,N,F,Gurgaon,WEBSITE,5.0
2,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,18.0,9.693593e+09,N,F,Chennai,WEBSITE,5.0
3,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,26.0,9.693593e+09,N,M,Others,WEBSITE,5.0
4,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,6018.0,9.693593e+09,N,M,Gurgaon,WEBSITE,5.0

In [18]:
Month_have_maximum_Revenue = df.groupby(['month'])[['ORDER_TOTAL']].sum()

Month_have_maximum_Revenue.nlargest(1,columns='ORDER_TOTAL',keep='all')

       ORDER_TOTAL
month
6.0    28335743.68

### Q10. Number of customers are inactive (that haven't ordered in the last 60 days)

In [19]:
maximum = df[['ORDER_DATE']].agg(np.max)
maximum

ORDER_DATE   2016-07-30
dtype: datetime64[ns]

In [20]:
max_date_customer = df.groupby(['CUSTOMER_KEY'])[['ORDER_DATE']].agg(np.max)
max_date_customer

             ORDER_DATE
CUSTOMER_KEY
C100000      2016-07-15
C100001      2016-05-18
C100002      2016-05-25
C100003      2016-05-18
C100004      2016-05-18
...                 ...
C19486       2016-07-18
C19487       2016-07-18
C19488       2016-07-18
C19489       2016-07-19
C19490       2016-07-19

[11137 rows x 1 columns]

In [21]:
inactive = maximum - max_date_customer
inactive

             ORDER_DATE
CUSTOMER_KEY
C100000         15 days
C100001         73 days
C100002         66 days
C100003         73 days
C100004         73 days
...                 ...
C19486          12 days
C19487          12 days
C19488          12 days
C19489          11 days
C19490          11 days

[11137 rows x 1 columns]

In [22]:
inactive[inactive['ORDER_DATE'] > '60 days'].count()

ORDER_DATE    3639
dtype: int64

In [23]:
 df.groupby(['ORDER_DATE'])[['ORDER_NUMBER']].count()

            ORDER_NUMBER
ORDER_DATE
2015-11-01           118
2015-11-02           276
2015-11-03           202
2015-11-04           704
2015-11-05           387
...                  ...
2016-07-18          1297
2016-07-19           119
2016-07-20             2
2016-07-21             4
2016-07-30            16

[259 rows x 1 columns]

### Q11. Growth Rate  (%) in Orders (from Nov’15 to July’16)

In [24]:
Nov_July = df[df['ORDER_DATE'].between("2015-11-01", "2016-07-31")]
Grouping = Nov_July.groupby(['ORDER_DATE'])[['ORDER_NUMBER']].count()
Grouping

            ORDER_NUMBER
ORDER_DATE
2015-11-01           118
2015-11-02           276
2015-11-03           202
2015-11-04           704
2015-11-05           387
...                  ...
2016-07-18          1297
2016-07-19           119
2016-07-20             2
2016-07-21             4
2016-07-30            16

[259 rows x 1 columns]

In [25]:
start_value = float(Grouping.iloc[0])
end_value = float(Grouping.iloc[-1])
num_periods = len(Grouping)

In [49]:
def cagr(start_value, end_value, num_periods):
    return (end_value / start_value) ** (1 / (num_periods - 1)) - 1

result = cagr(start_value, end_value, num_periods)
print(result)
print("{:.2%}".format(result))

-0.007812881779207359
-0.78%

### Q12. Growth Rate (%) in Revenue (from Nov'15 to July'16)

In [27]:
Grouping_revenue = Nov_July.groupby(['ORDER_DATE'])[['ORDER_TOTAL']].sum()

In [28]:
Grouping_revenue

             ORDER_TOTAL
ORDER_DATE
2015-11-01  6.789200e+04
2015-11-02  2.230036e+05
2015-11-03  1.125242e+05
2015-11-04  4.439703e+05
2015-11-05  3.518177e+05
...                  ...
2016-07-18  1.021991e+06
2016-07-19  6.804367e+04
2016-07-20  1.122780e+03
2016-07-21  1.211250e+03
2016-07-30  8.973530e+03

[259 rows x 1 columns]

In [29]:
start_value = float(Grouping_revenue.iloc[0])
end_value = float(Grouping_revenue.iloc[-1])
num_periods = len(Grouping_revenue)

In [48]:
def cagr(start_value, end_value, num_periods):
    return (end_value / start_value) ** (1 / (num_periods - 1)) - 1

result = cagr(start_value, end_value, num_periods)
print(result*100)

-0.7812881779207359

### Q13. What is the percentage of Male customers exists?

In [46]:
male = df[['Gender']].value_counts(normalize=True).iloc[:1] * 100
male

Gender
M         70.198725
dtype: float64

### Q14. Which location have maximum customers?

In [62]:
df.groupby(['Location'])[['CUSTOMER_KEY']].count().sort_values(by='CUSTOMER_KEY',ascending=False).head(1)

          CUSTOMER_KEY
Location
Gurgaon          68830

### Q15. How many orders are returned? (Returns can be found if the order total value is negative value)

In [75]:
df[df['ORDER_TOTAL']<0]['ORDER_TOTAL'].count()

249

### Q16. Which Acquisition channel is more efficient in terms of customer acquisition?

In [80]:
df.groupby(['Acquired Channel'])[['CUSTOMER_KEY']].count().sort_values(by='CUSTOMER_KEY',ascending=False).head(1)

                  CUSTOMER_KEY
Acquired Channel
WEBSITE                 105376

### Q17. Which location having more orders with discount amount?

In [88]:
city_with_discount = df[df['DISCOUNT']>0]
city_with_discount.head()

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel,month
34,O100015,C100002,270.27,400.0,2016-05-20,Delivered,ON-TIME,3.0,9.779086e+09,N,M,Gurgaon,WEBSITE,5.0
35,O100015,C100002,270.27,400.0,2016-05-20,Delivered,ON-TIME,9.0,9.779086e+09,N,F,Chennai,WEBSITE,5.0
36,O100015,C100002,270.27,400.0,2016-05-20,Delivered,ON-TIME,16.0,9.779086e+09,N,F,Gurgaon,WEBSITE,5.0
37,O100015,C100002,270.27,400.0,2016-05-20,Delivered,ON-TIME,17.0,9.779086e+09,N,F,Chennai,WEBSITE,5.0
38,O100016,C100002,0.00,164.0,2016-05-20,Delivered,ON-TIME,3.0,9.779086e+09,N,M,Gurgaon,WEBSITE,5.0

In [96]:
city_with_discount.groupby(['Location'])[['ORDER_NUMBER']].count().sort_values(by='ORDER_NUMBER',ascending=False).head(1)

          ORDER_NUMBER
Location
Gurgaon            982

### Q18. Which location having maximum orders delivered in delay?

In [119]:
location_having_delay = df[df['DELIVERY_STATUS'] == 'LATE']
location_having_delay

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel,month
74,O100006,C100006,1283.250000,0.0,2016-05-19,Delivered,LATE,7.0,9.477025e+09,N,F,Chennai,APP,5.0
221,O101860,C10067,2555.590088,0.0,2016-01-07,Delivered,LATE,10.0,9.746923e+09,N,F,Gurgaon,APP,1.0
222,O101860,C10067,2555.590088,0.0,2016-01-07,Delivered,LATE,20.0,9.746923e+09,N,M,Bangalore,WEBSITE,1.0
223,O101860,C10067,2555.590088,0.0,2016-01-07,Delivered,LATE,31.0,9.746923e+09,N,F,Gurgaon,WEBSITE,1.0
224,O101860,C10067,2555.590088,0.0,2016-01-07,Delivered,LATE,969.0,9.746923e+09,N,F,Others,WEBSITE,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173564,O129274,C19395,1078.090000,0.0,2016-07-17,Delivered,LATE,29275.0,9.837446e+09,N,M,Bangalore,WEBSITE,7.0
173591,O129328,C19423,99.070000,0.0,2016-07-17,Delivered,LATE,29329.0,9.056898e+09,N,M,Chennai,WEBSITE,7.0
173618,O129454,C19446,214.790000,200.0,2016-07-18,Delivered,LATE,29455.0,9.220270e+09,N,M,Chennai,APP,7.0
173623,O129490,C19456,755.910000,200.0,2016-07-18,Delivered,LATE,29491.0,9.382241e+09,N,F,Chennai,APP,7.0
173645,O129580,C19479,705.250000,200.0,2016-07-18,Delivered,LATE,29581.0,9.180275e+09,N,F,Gurgaon,APP,7.0

In [121]:
location_having_delay.groupby(['Location'])[['ORDER_NUMBER']].count().sort_values(by='ORDER_NUMBER',ascending=False).head(1)

          ORDER_NUMBER
Location
Gurgaon           3777

### Q19. What is the percentage of customers who are males acquired by APP channel?

In [178]:
male_app = df[(df['Gender'] == 'M') & (df['Acquired Channel'] == 'APP')]
male_app

q = male_app.groupby(['CUSTOMER_KEY'])[['CUSTOMER_KEY']].count().count()
q

CUSTOMER_KEY    5262
dtype: int64

In [179]:
male_all = df[(df['Gender'] == 'M')]
male_all

w = male_all.groupby(['CUSTOMER_KEY'])[['CUSTOMER_KEY']].count().count()
w

CUSTOMER_KEY    9190
dtype: int64

In [181]:
print((q/w)*100)

CUSTOMER_KEY    57.257889
dtype: float64

### Q20. What is the percentage of orders got canceled?

In [182]:
cancelled_orders = df[df['ORDER_STATUS'] == 'Cancelled'][['ORDER_STATUS']].count()
cancelled_orders

ORDER_STATUS    1110
dtype: int64

In [183]:
total_orders = df[['ORDER_STATUS']].count()
total_orders

ORDER_STATUS    173657
dtype: int64

In [184]:
percentage_of_orders_got_canceled = (cancelled_orders/total_orders) * 100
percentage_of_orders_got_canceled

ORDER_STATUS    0.639191
dtype: float64

### Q21. What is the percentage of orders done by happy customers (Note: Happy customers mean customer who referred other customers)?

In [205]:
df.head()

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel,month
0,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,1.0,9.693593e+09,N,M,Chennai,APP,5.0
1,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,11.0,9.693593e+09,N,F,Gurgaon,WEBSITE,5.0
2,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,18.0,9.693593e+09,N,F,Chennai,WEBSITE,5.0
3,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,26.0,9.693593e+09,N,M,Others,WEBSITE,5.0
4,O100000,C100000,85.0,0.0,2016-05-18,Delivered,ON-TIME,6018.0,9.693593e+09,N,M,Gurgaon,WEBSITE,5.0

In [210]:
referred_y = df[df['Referred Other customers'] == 'Y'].groupby(["CUSTOMER_KEY"])[['ORDER_NUMBER']].count().sum()
referred_y

ORDER_NUMBER    866
dtype: int64

In [212]:
referred_all = df.groupby(["CUSTOMER_KEY"])[['ORDER_NUMBER']].count().sum()
referred_all

ORDER_NUMBER    173657
dtype: int64

In [213]:
Happy_customers = (referred_y/referred_all) * 100
Happy_customers

ORDER_NUMBER    0.498684
dtype: float64

### Q22. Which Location having maximum customers through reference?

In [218]:
df[df['Referred Other customers'] == 'Y'].groupby(['Location'])[['CUSTOMER_KEY']].count().sort_values(by='CUSTOMER_KEY',ascending=False).head(1)

          CUSTOMER_KEY
Location
Gurgaon            390

### Q23. What is order_total value of male customers who are belongs to Chennai and Happy customers (Happy customer definition is same in question 21)?

In [221]:
df[(df['Gender'] == 'M') & (df['Location'] == 'Chennai') & (df['Referred Other customers'] == 'Y')][['ORDER_TOTAL']].sum()

ORDER_TOTAL    521391.0
dtype: float64

### Q24. Which month having maximum order value from male customers belongs to Chennai?

In [226]:
df[(df['Gender'] == 'M') & (df['Location'] == 'Chennai')].groupby(['month'])[['ORDER_TOTAL']].sum().sort_values(by='ORDER_TOTAL',ascending=False).head(1)

       ORDER_TOTAL
month
6.0     7067603.52

### Q25. What are number of discounted orders ordered by female customers who were acquired by website from Bangalore delivered ontime?

In [233]:
no_of_discounted_orders = df[(df['DISCOUNT'] > 0) & (df['Gender'] == 'F') & (df['Acquired Channel'] == 'WEBSITE') & (df['Location'] == 'Bangalore') & (df['DELIVERY_STATUS'] == 'ON-TIME')]
no_of_discounted_orders

,ORDER_NUMBER,CUSTOMER_KEY,ORDER_TOTAL,DISCOUNT,ORDER_DATE,ORDER_STATUS,DELIVERY_STATUS,CUSTOMER_ID,CONTACT_NUMBER,Referred Other customers,Gender,Location,Acquired Channel,month
2765,O127788,C10078,1648.50,200.0,2016-07-11,Delivered,ON-TIME,108.0,9.244927e+09,N,F,Bangalore,WEBSITE,7.0
2767,O127788,C10078,1648.50,200.0,2016-07-11,Delivered,ON-TIME,399.0,9.244927e+09,N,F,Bangalore,WEBSITE,7.0
27377,O105540,C100812,94.34,200.0,2016-07-04,Delivered,ON-TIME,5931.0,9.953727e+09,N,F,Bangalore,WEBSITE,7.0
31002,O127526,C100643,362.70,200.0,2016-07-10,Delivered,ON-TIME,27527.0,9.343474e+09,N,F,Bangalore,WEBSITE,7.0
32832,O105937,C100961,208.00,200.0,2016-07-13,Delivered,ON-TIME,5938.0,9.422833e+09,N,F,Bangalore,WEBSITE,7.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173202,O128193,C19064,35.45,200.0,2016-07-14,Delivered,ON-TIME,28458.0,9.463201e+09,N,F,Bangalore,WEBSITE,7.0
173250,O128321,C19105,1219.74,200.0,2016-07-13,Delivered,ON-TIME,28322.0,9.960557e+09,N,F,Bangalore,WEBSITE,7.0
173461,O129002,C19294,2537.93,200.0,2016-07-16,Delivered,ON-TIME,29003.0,9.441064e+09,N,F,Bangalore,WEBSITE,7.0
173484,O129078,C19312,458.34,200.0,2016-07-16,Delivered,ON-TIME,29079.0,9.360500e+09,N,F,Bangalore,WEBSITE,7.0
173588,O129320,C19391,287.84,200.0,2016-07-17,Delivered,ON-TIME,29321.0,9.362240e+09,N,F,Bangalore,WEBSITE,7.0

In [234]:
no_of_discounted_orders['DISCOUNT'].count()

81